{"data":{"markdownRemark":{"html":"<p>CKB has a Bitcoin-like consensus model namely NC-Max. NC is short for Nakamoto Consensus, which refers to the protocol used by Bitcoin. NC-Max is a tweaked version of NC, targeting higher performance and robustness.</p>\n<h2 id=\"nc-is-cool\"><a href=\"#nc-is-cool\" aria-label=\"nc is cool permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>NC Is Cool</h2>\n<p>There are today a large number of NC derivatives used by blockchain projects, however NC is still the best.\nNervos Team developed a quantitive method to evaluate the performance of all the NC derivatives. If you consider all aspects, including selfish mining, you will find no other NC-like protocols doing better than NC.</p>\n<p>So Nervos decided to stick to NC, but still tries to make possible improvements.</p>\n<h2 id=\"fight-limited-bandwidth\"><a href=\"#fight-limited-bandwidth\" aria-label=\"fight limited bandwidth permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Fight limited Bandwidth</h2>\n<p>The biggest bottleneck for all the NC-like protocols is natural bandwidth.</p>\n<p>Once you send a transaction to the network. And the transaction will be replicated to all the network nodes. So part of the bandwidth will be used to synchronize transactions. Once this is done, consensus is reached to decide which subset of the transactions will be included in next block. The consensus process also consume part of the bandwidth since some communications are needed. Given a transaction always take certain amount of bytes in size and the natural bandwidth is limited, the upper bound of the performance is clearly there, and there is no way to bypass that.</p>\n<p>But we see an obvious problem here for NC, that we called double-transmit-problem. Every Bitcoin transaction needs to be broadcasted twice. The first transmit happens when a user constructs a new transaction and broadcasts it to all the nodes. The second happens when a miner creates the next block and broadcasts it to all the nodes, so the transactions in the block will be broadcasted again.</p>\n<p>NC-Max solved the double-transmit-problem and gets a performance gain. It works through a two phrase commit, so that node only need to receive a transaction once, we won’t go into the tech details here.</p>\n<p>So fixing double transmit problem helps to have a better performance.</p>\n<h2 id=\"utilize-increasing-bandwidth\"><a href=\"#utilize-increasing-bandwidth\" aria-label=\"utilize increasing bandwidth permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Utilize Increasing Bandwidth</h2>\n<p>But there is a second way to have even better performance.\nThe Internet bandwidth is increasing all the time, Bitcoin take a fixed approach to have 10min block time and 1M block size, which can not take advantage of the increasing bandwidth, while NC-max tries to fix this.</p>\n<p>NC-max makes some parameters adjustable to have an adaptive consensus. The NC-max difficulty is adjusted according to orphan rate, rather than block time as Bitcoin. Because the orphan block rate is a signal of the network condition, if the network latency is low, the orphan block rate will decrease, vice versa. So when running under a good network speed, CKB will have lower difficulty to produce more blocks in a same time gap and thus increase the throughput of the network.</p>\n<p>So having the mining difficulty adjustable according to orphan block rate, is the second way to make good use increasing bandwidth.</p>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>This is NC-max. NC-max utilizes NC’s brilliance and made two improvements to fully utilize the bandwidth: NO.1 fixing the double-transmit-problem NO.2 having an  adaptive consensus. The final result is NC-max can reach 200 transactions per second, which is great to have as a global POW consensus chain.</p>","frontmatter":{"title":"What Is NC-Max?","next":null,"prev":null},"fields":{"path":"content/book/en/nc-max.md","slug":"book/en/nc-max.html"}}},"pageContext":{"slug":"book/en/nc-max.html"}}