{"data":{"markdownRemark":{"html":"<p>CKB has a very different programming model, an abstract programming model. Why do we need an abstract programming model?</p>\n<h2 id=\"why-abstract-programming-model\"><a href=\"#why-abstract-programming-model\" aria-label=\"why abstract programming model permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Why abstract programming model?</h2>\n<p>There is a problem that blockchains are often lack of cryptography primitives. An abstract programming model fix this.\nWhy is the lack of cryptography primitives a problem? As a layer1, you need to communicate with all kinds of layer2 protocols, and many of these layer2 protocols use novel cryptography technologies as components of their protocols.</p>\n<p>For example, different layer2 protocols may use different signature algorithms, layer1 is expected to be able to handle them all well. This is just one example, people always want to use all kinds of cryptography primitives on layer2, and expecting layer1 can handle it anyway. But on Bitcoin or Ethereum, the only way to add a new primitive is to do a hard fork, adding a new OP_CODE to the chains.</p>\n<p>But if we have an abstract programming model, this is easy to do. Being abstract means trying the best to push things to upper layers, so that the layer1 VM itself can be as simple and abstract as possible. </p>\n<p>Being simple means a lot to a layer1 blockchain. We can have a much simpler cost model. It’s easy to determine how many gas you should charge for a certain OP<em>CODE. CKB VM uses RISC-V instruction set. Nervos believes blockchain instructions should be low-level. High-level is a synonym to complexity. So it’s very easy to get how many CPU cycles one OP</em>CODE cost, as we calculating the gas fee for it.</p>\n<h2 id=\"adding-primitives-at-will\"><a href=\"#adding-primitives-at-will\" aria-label=\"adding primitives at will permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Adding Primitives At Will</h2>\n<p>A Blockchain is a hardware-like software. It is a software, but it’s like hardware in that it is hard to upgrade.</p>\n<p>By pushing the complexity to an upper layer, we can do a lot things in user space. And blockchain and evolve faster because its always easy to do things in user space.</p>\n<p>There is NO hard coded crypto-primitives in CKB-VM. There is no special OP_CODE in CKB-VM. The problem with this design is that if you run all the primitives in VM layer, it ought to be slow. That’s why no other chain is doing it this way. But CKB VM uses a hardware instruction set, which makes it easy to optimize the compiled code, to make the primitive code run faster. For example, secp256k1 is the default primitive CKB default transaction signature. It works as a smart contract deployed on CKB.</p>\n<p>How to do it? We get the source code for secp256k1, compile it to RISC-V supported binary format, deploy the binary to CKB-VM. And whenever a transaction needs to be signed, the VM refers to the binary running. As tests shows, a verification takes 9ms, while it’s 1ms if the primitive is built in the chain. So it’s not as fast but acceptable, since the bottleneck is somewhere else. That is way CKB-VM is very flexible, because whenever a layer2 user wants her own primitive, she can just deploy it on CKB-VM, as we do for secp256k1. Moreover, since it’s just gcc compatible hardware-like instruction set, and all other primitives are mostly written in C, so it’s easy to deploy them on CKB-VM. </p>\n<h2 id=\"abstract-state-model\"><a href=\"#abstract-state-model\" aria-label=\"abstract state model permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Abstract State Model</h2>\n<p>VM is only the computation part of the abstract programming model, the other part is an abstract state model.</p>\n<p>CKB is a generalization of Bitcoin. CKB state object is a generalization of UTXO, which we call cell. You can store not just numbers but all sorts of data in a cell. The transaction structure is similar to Bitcoin. And the whole system is very much like Bitcoin, so we won’t go details here.</p>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>CKB has an abstract programming model. The VM is made very simple and low level, so that most things is don’t in user space. Layer2 users can deploy there own crypto-primitives at will, and CKB also offers a abstract state model to support the programming model.</p>\n<p>ref:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=F1nfrTsGJqk\">https://www.youtube.com/watch?v=F1nfrTsGJqk</a></li>\n</ul>","frontmatter":{"title":"Abstract Programming Model","next":null,"prev":null},"fields":{"path":"content/book/en/p-model.md","slug":"book/en/p-model.html"}}},"pageContext":{"slug":"book/en/p-model.html"}}