{"data":{"markdownRemark":{"html":"<p>Nervos is a layered network, which is comprised of layers of protocols, rather than only one layer and one protocol as some other blockchains are.</p>\n<h2 id=\"why-is-layer1\"><a href=\"#why-is-layer1\" aria-label=\"why is layer1 permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Why Is Layer1?</h2>\n<p>Before talking about Nervos’s specific layers, let’s first define what is a layered architecture and what is a layer1 blockchain.</p>\n<p>The key difference between layer1 and layer2 is the consensus scope. Consensus scope means how many people will join the consensus process. Layer1 should have the broadest consensus, which is the global consensus. This is what permission-less blockchains are doing. Layer2 will have a smaller consensus scope, think Plasma. One Plasma usually only have 20–30 nodes. State Channel is also a layer2, you only need to reach consensus between two people.</p>\n<h2 id=\"why-layer2-has-smaller-consensus-scope\"><a href=\"#why-layer2-has-smaller-consensus-scope\" aria-label=\"why layer2 has smaller consensus scope permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Why Layer2 has Smaller Consensus Scope?</h2>\n<p>Consensus is expensive.</p>\n<p>To reach global consensus, the cost is very high. If we can reduce consensus scope, we will get a great performance and cost improvement. That’s why a layered network has a potential to bring much more scalability.</p>\n<p>Having layers is not only a scalability method, it’s also a separation of concerns, which means different layers is responsible for different problems. This is useful for lots of problems we face today in blockchain world. </p>\n<p>For example, we can have computation on one layer and verification on another. We don’t need to mix the two tasks together. The separation of computation and verification is very natural in other cryptography area. Like signature verification, someone generate the signature first, then someone else do the verification. Or like ZkSnark, someone generate the proof, someone else verify it. Layering is a very natural match to such separation.</p>\n<p>We can also do separation to have a transaction layer and a value preservation layer, which is sometimes called store of value layer.</p>\n<p>We can have compliance on one layer and neutrality on another. Many companies need to be compliant to financial regulations. We want to move real world assets to blockchain, but this is only doable on permission blockchain, cause we need KYC and AML. But how can you do it on a permission-less blockchain. Should layer1 protocol also comply to those regulations, or should it be neutral? We believe the layer1 blockchain should be neutral just like the Internet. It’s hard to be compliant to all regulations, since there are so many countries on earth, and each of them has different regulations. But still we can do compliance on layer2, because it has much small consensus scope.</p>\n<h2 id=\"can-any-blockchain-be-layer1\"><a href=\"#can-any-blockchain-be-layer1\" aria-label=\"can any blockchain be layer1 permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Can any Blockchain Be Layer1?</h2>\n<p>With the definition clear, can any blockchain be layer1? Of course NOT.</p>\n<p>For layer1, we want two things most. One is decentralization , that is for censorship-resistance, and the other is security, layer1 must be the most secure layer in the whole network. Because it is the foundation of security for the whole network.\nTwo most known blockchain project is Bitcoin and Ethereum, they both have global consensus and very secure. There are others out there, but in our definition, they are not layer1 blockchains. Because it has smaller consensus scope if you think carefully, say some chain has only 21 consensus node.</p>\n<p>Why we build our own layer1 blockchain named CKB? Both Bitcoin and Ethereum were not designed for the scenarios we have in mind. Bitcoin is nearly perfect, but it is only for money, really limited scripting ability makes its hard to have broader use cases. Ethereum has a whole lot features, but still it was not designed as a layer1 protocol, which makes it hard to use it working with layer2 protocols.</p>\n<p>That’s why we designed CKB, its a layer1 blockchain with layer2 in mind.</p>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>We see a world where economy runs on a stack of protocols. So we designed Nervos with that mindset, and have a layered solution. Layer1 protocol works well with layer2 ones and a neat separation of concerns makes the system both secure and scalable.</p>\n<p>ref:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=F1nfrTsGJqk\">https://www.youtube.com/watch?v=F1nfrTsGJqk</a></li>\n</ul>","frontmatter":{"title":"Why Build A Layer1 Blockchain?","next":null,"prev":null},"fields":{"path":"content/book/en/layering.md","slug":"book/en/layering.html"}}},"pageContext":{"slug":"book/en/layering.html"}}