{"data":{"markdownRemark":{"html":"<p>What is a public blockchain? How a consortium chain and a public chain differ and what’s the defining characteristics of public blockchains?</p>\n<h2 id=\"public-blockchain-and-consortium-blockchain\"><a href=\"#public-blockchain-and-consortium-blockchain\" aria-label=\"public blockchain and consortium blockchain permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Public Blockchain and Consortium Blockchain</h2>\n<p>In 2008 somebody or a group under the name Satoshi Nakamoto created Bitcoin, and Bitcoin network lanunched in 2009. The ground-breaking new technology used by Bitcoin is now called Blockchain.</p>\n<p><img src=\"https://img.haoqicat.com/2019060901.jpg\"></p>\n<p>Blockchain did not come out of nothing. It is based on cryptography, before Bitcoin, a lot of tech breakthrough in this area actually laid down the foundation for Bitcoin. Public Key Encryption, Proof Of Work, Elliptic Curve Cryptography, SHA256 were invented long before Bitcoin was born and later became the components of Bitcoin and Blockchain. People inspired by Bitcoin then started many other blockchain projects, which can be roughly categorized into two types, one is public blockchain like Bitcoin, Ethereum and Nervos and many others, the other is consortium chain, Hyperledger by Linux Foundation is a outstanding example.</p>\n<p>Consortium blockchains differ to their public counterpart in that they are not permission less, thus, not just anyone with an internet connection could gain access to them. Instead,  a few selected nodes are predetermined for consortium. So consortium blockchains are mostly centralized or semi-centralized. People who believe decentralization is essential to blockchains consider consortium chains are not blockchains, they say</p>\n<blockquote>\n<p>There is no premissioned blockchain, just somebody else’s database.</p>\n</blockquote>\n<p>and they also beleive</p>\n<blockquote>\n<p>Blockchain without incentive is database.</p>\n</blockquote>\n<p>Since usually consortium chains does not rely on incentives to run, but public chains is run by many people who don’t really know each other, so they have to use native coins to incentivize people to join the network.</p>\n<p>But consortium chains still has their own use case. Large organizations love them, can still do sth meaningful with them. Say different banks can utilize a consortium chain to establish mutual trust. On the other hand, while redundancy makes public blockchain extremely secure, it also makes it slow, being really performant is also a huge advantage of consortium chains.</p>\n<h2 id=\"public-chain-is-about-trust\"><a href=\"#public-chain-is-about-trust\" aria-label=\"public chain is about trust permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Public Chain Is About Trust</h2>\n<p>Public chain is about trust, a new way people interact with each other.</p>\n<p>Trust is what required for the world to run. In old time, many people never stepped out their village, so they only needed to trust some other individuals, say family members or friends. Today, people are collaboration in a state or global level, which means we often work with strangers, so we’ve switched from trusting individuals to trusting large organizations, say banks or big companies. But public blockchain inspired people foresee a future where we don’t need to trust people or organizations but to trust computers and math.</p>\n<p>Public blockchain is there for everyone. It is built by everyone, owned by everyone, governed by everyone, and used by everyone. It is trust worthy because the data security is protected by the consensus of many people who don’t know each other.</p>\n<h2 id=\"five-pillars\"><a href=\"#five-pillars\" aria-label=\"five pillars permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Five Pillars</h2>\n<p>Andreas M. Antonopoulos proposed a set of clear standards for people who want to check if a chain is a true or fake public chain, which is called five pillars of public blockchain: open, public, borderless, neutral, and censorship-resistant.</p>\n<p>Open. Open means that anyone can access it. Anyone can participate without getting permission from anyone. You don’t even to be a human to use a blockchain. Software can use blockchain. The blockchain does not care if you are a human or piece of software.</p>\n<p>Public. Public is the idea that everything you do is verifiable on the network to everybody else. No one can cheat. The system is overseen by everybody, but that doesn’t mean you have no privacy, it’s still possible to encrypt your data and still have it verifiable by zero-knowledge prove or other techniques.</p>\n<p>Borderless. Blockchain is borderless, it is like the Internet, there are no borders. It is a truly international phenomenon. That means, it does not matter where you are, where you live, where you travel. There blockchain is already there. </p>\n<p>Neutral. What does neutral mean? Neutral means my money is my money, I can give it to whoever I want. It means that a system of money should not care who the sender or the recipients is. It should not care what the purpose is. It should only get the transaction through. Just to provide the communication of value.</p>\n<p>Censorship resistant. It means if someone wants to stop me from sending my money, he can not do it. It means my assets won’t be confiscated by any powerful person or organization, it means the right of the weak side is protected, no one can cast unfair rules to the game.</p>\n<h2 id=\"conculsion\"><a href=\"#conculsion\" aria-label=\"conculsion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conculsion</h2>\n<p>Public blockchain is a technology, but it also has a potential to change our economics finance and how people interact with each other in a deep way. I hope you can understand what a public blockchain is by now.</p>\n<p>ref:</p>\n<ul>\n<li><a href=\"https://www.blockchaindailynews.com/The-difference-between-a-Private-Public-Consortium-Blockchain_a24681.html\">https://www.blockchaindailynews.com/The-difference-between-a-Private-Public-Consortium-Blockchain_a24681.html</a></li>\n<li><a href=\"https://www.mycryptopedia.com/consortium-blockchain-explained/\">https://www.mycryptopedia.com/consortium-blockchain-explained/</a></li>\n<li>The Five Pillars of Open Blockchains <a href=\"https://www.youtube.com/watch?v=qlAhXo-d-64\">https://www.youtube.com/watch?v=qlAhXo-d-64</a></li>\n</ul>","frontmatter":{"title":"What Is A Public Blockchain?","next":null,"prev":null},"fields":{"path":"content/book/en/public-chain.md","slug":"book/en/public-chain.html"}}},"pageContext":{"slug":"book/en/public-chain.html"}}